class AppConstants {
  static const String shareApp =
      "برطمان السعادة (السعادة برسالة) 🦋 \n تطبيق يتناسب مع إحتياجاتك الترفيهية والنفسية وحالتك المزاجية ، كالرفيق الدائم سأئتيك فى التوقيت المناسب على مدار اليوم والليلة برسائل قصيرة تحتوى على الكثير من كلمات السعادة والتفاؤل ، وأحتوي بداخلي على مئات الرسائل المضافة سابقاً وعشرات الرسائل التى تضاف بصورة يوميه ، بجانب الإشعارات التى ستسعد قلبك الجميل ~ رسالة سعادة ليك ولحبايبك 💙 \n \n لتحميل التطبيق من Google Play 👇\n $googlePlayUrl \n لتحميل التطبيق من App Store 👇 \n $appStoreUrl";
  static const String googlePlayUrl =
      "https://play.google.com/store/apps/details?id=com.jar.happiness";
  static const String appStoreUrl =
      "https://apps.apple.com/app/apple-store/id6565808195";
  static const String appStoreId = "6565808195";
  static const String appInfo =
      "برطمان السعادة 🦋 \nتطبيق يتناسب مع إحتياجاتك الترفيهية والنفسية وحالتك المزاجية ، كالرفيق الدائم سأئتيك فى التوقيت المناسب على مدار اليوم والليلة برسائل قصيرة تحتوى على الكثير من كلمات السعادة والتفاؤل ، وأحتوي بداخلي على مئات الرسائل المضافة سابقاً وعشرات الرسائل التى تضاف بصورة يوميه ، بجانب الإشعارات التى ستسعد قلبك الجميل ~ رسالة سعادة ليك ولحبايبك 💙";
  static const String getStartedMessage =
      "تطبيق يتناسب مع إحتياجاتك الترفيهية والنفسية وحالتك المزاجية ، كالرفيق الدائم سأئتيك فى التوقيت المناسب على مدار اليوم والليلة برسائل قصيرة تحتوى على الكثير من كلمات السعادة والتفاؤل ، وأحتوي بداخلي على مئات الرسائل المضافة سابقاً وعشرات الرسائل التى تضاف بصورة يوميه ، بجانب الإشعارات التى ستسعد قلبك الجميل ~ رسالة سعادة ليك ولحبايبك 💙";
  static const String notificationMessage =
      "نود إعلامك بأنه من الضروري الموافقة على إذن الإشعارات  لكي تتمكن من تلقي الرسائل التحفيزية والاقتباسات المميزة ..";
  static const String noInternetMessage =
      "يلزم وجود اتصال بالانترنت لاول مره فقط حتى يتم تحميل بيانات هذا القسم 👀";
  static const String shareAppMessage =
      "انشر السعادة وشارك تطبيق 'برطمان السعادة' مع أصدقائك! دعنا نساهم جميعًا في نشر التفاؤل والإيجابية كل يوم. 💙";
  static const String copyMessage = "من تطبيق برطمان السعادة 💙";
  static const String copyMessage2 = "من تطبيق برطمان السعادة 🦋";
  static const String emptyPostsUser =
      "لم تقم بإضافة أي اقتباسات خاصة بك. أضف الآن!";
  static const String emptyPosts =
      "لعرض اقتباسات المستخدمين، يلزم أن تكون متصلًا بالإنترنت. يمكنك مشاهدة اقتباساتك الخاصة، وأيضًا إضافة اقتباس جديد ليظهر لجميع المستخدمين 👀";
  static const String emptyFeeling =
      "لتتمكن من استعراض الأقسام في قسم بماذا تشعر، يلزم الاتصال بالإنترنت عند التحميل لأول مرة فقط. بعد ذلك، يمكنك تصفح الأقسام دون الحاجة للاتصال مجددًا 😊";
  static const String feelingsGetStarted =
      "هنا يُتاح للمستخدم اختيار شعور يعبر عن حالته النفسية أو مزاجه الحالي، مثل قلق، فرح، حزين، وهكذا. بناءً على الشعور الذي يختاره، يُعرض محتوى ملهم ومفيد، يتضمن دعاء، نصيحة، وحكمة تتناسب مع هذا الشعور. \n\n الهدف من هذا القسم هو تقديم محتوى مخصص يساعد المستخدم في تحسين حالته النفسية، أو التفكير بإيجابية، أو حتى إيجاد راحة نفسية، وذلك بناءً على الحالة التي يشعر بها.";
  static const String appVersionMessage =
      "يرجى التأكد من أنك تستخدم أحدث نسخة محدثة من التطبيق. إذا أعجبك، لا تتردد في تقييم التطبيق ومشاركته مع أصدقائك لتشجيعنا على تقديم الأفضل!";
  static const String deleteAccountMessage =
      "تحذير! سيتم حذف حسابك نهائيًا ولن تتمكن من استعادته مرة أخرى. هل أنت متأكد أنك تريد المتابعة؟";
  static const String setFadfadaPinMessage =
      "لحماية خصوصيتك ومشاعرك اللي بتشاركها في ركن الفضفضة، بنطلب منك تعيين رقم سري خاص بيك.\n"
      "الرقم السري ده هيساعد في تأمين ملاحظاتك ومنع أي حد تاني من الاطلاع عليها حتى لو مسك جهازك.\n"
      "كمان هتختار سؤال أمان تقدر تستخدمه لو نسيت الرقم السري في المستقبل.\n"
      "فضفض براحتك... إحنا هنا علشانك 💙";
}
